Repository: FidelisKagashe26/HazinaYaVitabuNew
Catalog: locale/*/LC_MESSAGES/django.po
Languages: sw

source: Out of Stock
sw: Haijapatikana

source: An error occurred. Please try again.
sw: Hitilafu imetokea. Tafadhali jaribu tena.

source: Add to Cart
sw: Ongeza Kitengani

source: Admin Menu
sw: Menyu ya Msimamizi

source: Monthly Reports
sw: Ripoti za Kila Mwezi

source: Django Admin
sw: Msimamizi wa Django

source: View Products
sw: Angalia Bidhaa

source: Book Sales Report
sw: Ripoti ya Mauzo ya Vitabu

source: Seller Menu
sw: Menyu ya Muuzaji

source: Book Sales
sw: Mauzo ya Vitabu

source: Record individual book sales for
sw: Rekodi mauzo ya vitabu vya

source: Record Book Sale
sw: Rekodi Uuzaji wa Kitabu

source: Select Book
sw: Chagua Kitabu

source: Choose a book...
sw: Chagua kitabu...

source: Sold for Money
sw: Viliouzwa kwa Pesa

source: Given for Free
sw: Vilitolewa Bure

source: Sale Price per Book
sw: Bei ya Uuzaji kwa Kitabu

source: Notes
sw: Maelezo

source: Additional notes about this sale...
sw: Maelezo ya ziada kuhusu uuzaji huu...

source: Record Sale
sw: Rekodi Uuzaji

source: Today's Book Sales
sw: Mauzo ya Vitabu ya Leo

source: Sold
sw: Viliouzwa

source: copies of
sw: nakala za

source: Free
sw: Bure

source: Price
sw: Bei

source: Revenue
sw: Mapato

source: Today's Summary
sw: Muhtasari wa Leo

source: Different Books Sold
sw: Vitabu Tofauti Vilivyouzwa

source: Total Revenue
sw: Jumla ya Mapato

source: No book sales recorded today.
sw: Hakuna mauzo ya vitabu yaliyorekodiwa leo.

source: Buyer Dashboard
sw: Dashibodi ya Mnunuzi

source: Recent Orders
sw: Maagizo ya Hivi Karibuni

source: Order
sw: Agizo

source: Total
sw: Jumla

source: Seller
sw: Muuzaji

source: No orders yet.
sw: Hakuna maagizo bado.

source: Recent Products
sw: Bidhaa za Hivi Karibuni

source: View Details
sw: Angalia Maelezo

source: Browse Products
sw: Vinjari Bidhaa

source: Discover new books
sw: Gundua vitabu vipya

source: View Cart
sw: Angalia Kitenga

source: Check your items
sw: Angalia vitu vyako

source: Profile Settings
sw: Mipangilio ya Wasifu

source: Update your info
sw: Sasisha taarifa zako

source: Select Report Date
sw: Chagua Tarehe ya Ripoti

source: Report Date
sw: Tarehe ya Ripoti

source: Load Report
sw: Pakia Ripoti

source: Houses Visited
sw: Nyumba Zilizotembeleewa

source: Teachings Given
sw: Mafundisho Yaliyotolewa

source: Working Hours
sw: Masaa ya Kufanya Kazi

source: Books Sold
sw: Vitabu Vilivyouzwa

source: Books Given Free
sw: Vitabu Vilivyotolewa Bure

source: Home
sw: Nyumbani

source: Shop
sw: Dukani

source: Cart
sw: Kikapu

source: Hello
sw: Hujambo

source: Toggle Theme
sw: Badilisha Mandhari

source: Profile
sw: Wasifu

source: My Dashboard
sw: Dashibodi Yangu

source: Seller Dashboard
sw: Dashibodi ya Muuzaji

source: Admin Dashboard
sw: Dashibodi ya Msimamizi

source: Logout
sw: Toka

source: Login
sw: Ingia

source: Register
sw: Jisajili

source: Welcome Back
sw: Karibu Tena

source: Sign in to your account
sw: Ingia kwenye akaunti yako

source: Username
sw: Jina la Mtumiaji

source: Enter your username
sw: Ingiza jina lako la mtumiaji

source: Password
sw: Nenosiri

source: Enter your password
sw: Ingiza nenosiri lako

source: Don't have an account?
sw: Huna akaunti?

source: Forgot Password?
sw: Umesahau nenosiri?

source: Back to Home
sw: Rudi Nyumbani

source: First Name
sw: Jina la Kwanza

source: Last Name
sw: Jina la Mwisho

source: Email
sw: Barua Pepe

source: Phone Number
sw: Namba ya Simu

source: Role
sw: Jukumu

source: Joined
sw: Alijiunga

source: No Role
sw: Hakuna Jukumu

source: Active
sw: Hai

source: Inactive
sw: Haikai

source: Generate and view monthly performance reports
sw: Tengeneza na uone ripoti za utendaji wa kila mwezi

source: Generate Monthly Report
sw: Tengeneza Ripoti ya Mwezi

source: Month
sw: Mwezi

source: Year
sw: Mwaka

source: Generate Reports
sw: Tengeneza Ripoti

source: Monthly Reports for
sw: Ripoti za Mwezi za

source: Books Free
sw: Vitabu Bure

source: Houses
sw: Nyumba

source: Teachings
sw: Mafundisho

source: Total Hours
sw: Jumla ya Masaa

source: Days Worked
sw: Siku za Kufanya Kazi

source: No monthly reports available. Generate reports using the form above.
sw: Hakuna ripoti za kila mwezi zinazopatikana. Tengeneza ripoti kwa kutumia fomu hapo juu.

source: Password Reset
sw: Kurudisha Nenosiri

source: Enter your email to receive a reset code
sw: Ingiza barua pepe yako kupokea msimbo wa kurudisha

source: Email Address
sw: Anuani ya Barua Pepe

source: Enter your email
sw: Ingiza barua pepe yako

source: Send Reset Code
sw: Tuma Msimbo wa Kurudisha

source: Back to Login
sw: Rudi kwenye Kuingia

source: Set New Password
sw: Weka Nenosiri Jipya

source: Enter your new password
sw: Ingiza nenosiri lako jipya

source: New Password
sw: Nenosiri Jipya

source: Confirm New Password
sw: Thibitisha Nenosiri Jipya

source: Reset Password
sw: Rudisha Nenosiri

source: My Profile
sw: Wasifu Wangu

source: Manage your account information
sw: Dhibiti taarifa za akaunti yako

source: Update Your Information
sw: Sasisha Taarifa Zako

source: Save Changes
sw: Hifadhi Mabadiliko

source: Create Account
sw: Unda Akaunti

source: Join Hazina ya Vitabu today
sw: Jiunge na Hazina ya Vitabu leo

source: Email is optional but recommended for order notifications
sw: Barua pepe si lazima lakini inashauriwa kwa taarifa za maagizo

source: Confirm Password
sw: Thibitisha Nenosiri

source: Already have an account?
sw: Tayari una akaunti?

source: Pending Orders
sw: Maagizo Yanayosubiri

source: Customer
sw: Mteja

source: Phone
sw: Simu

source: Registered
sw: Amesajiliwa

source: Accept Order
sw: Kubali Agizo

source: Anonymous Order
sw: Agizo la Mtu Asiyejulikana

source: Anonymous
sw: Asiyejulikana

source: My Orders
sw: Maagizo Yangu

source: Mark Complete
sw: Weka Alama ya Kukamilika

source: No orders assigned to you yet.
sw: Hakuna maagizo yaliyokupewa bado.

source: Today's Report
sw: Ripoti ya Leo

source: Update Report
sw: Sasisha Ripoti

source: Fill Report
sw: Jaza Ripoti

source: No report filled for today. Please fill your daily report.
sw: Hakuna ripoti iliyojazwa leo. Tafadhali jaza ripoti yako ya kila siku.

source: Superuser Dashboard
sw: Dashibodi ya Msimamizi Mkuu

source: System Overview and Management
sw: Muhtasari wa Mfumo na Usimamizi

source: Total Users
sw: Watumiaji Wote

source: Sellers
sw: Wauzaji

source: Buyers
sw: Wanunuzi

source: Total Orders
sw: Maagizo Yote

source: Anonymous Orders
sw: Maagizo ya Watu Wasiojulikana

source: Add/Edit Users
sw: Ongeza/Hariri Watumiaji

source: Daily/Monthly Reports
sw: Ripoti za Kila Siku/Mwezi

source: Generate & View
sw: Tengeneza na Uone

source: System Settings
sw: Mipangilio ya Mfumo

source: No reports submitted today.
sw: Hakuna ripoti zilizotumwa leo.

source: Recent Users
sw: Watumiaji wa Hivi Karibuni

source: First
sw: Wa Kwanza

source: Previous
sw: Uliopita

source: Page
sw: Ukurasa

source: of
sw: wa

source: Next
sw: Unaofuata

source: Last
sw: Wa Mwisho

source: This username is already taken. Please choose another.
sw: Jina hili la mtumiaji tayari limetumika. Tafadhali chagua jingine.

source: Username must be at least 3 characters long.
sw: Jina la mtumiaji lazima liwe na angalau herufi 3.

source: Username can only contain letters, numbers, and underscores.
sw: Jina la mtumiaji linaweza kuwa na herufi, nambari, na mistari ya chini tu.

source: Phone number must start with +255.
sw: Namba ya simu lazima ianze na +255.

source: Phone number must be exactly 13 digits long.
sw: Namba ya simu lazima iwe na tarakimu 13 haswa.

source: Phone number must only contain digits and the '+' sign.
sw: Namba ya simu lazima iwe na tarakimu na alama ya '+' tu.

source: This phone number is already registered. Please use a different number.
sw: Namba hii ya simu tayari imesajiliwa. Tafadhali tumia namba nyingine.

source: A user with this email already exists.
sw: Mtumiaji mwenye barua pepe hii tayari yupo.

source: User profile not found.
sw: Wasifu wa mtumiaji haujapatikana.

source: Account created successfully! You can now log in.
sw: Akaunti imeundwa kwa ufanisi! Sasa unaweza kuingia.

source: You have been logged out successfully.
sw: Umetoka kwa ufanisi.

source: Profile updated successfully!
sw: Wasifu umesasishwa kwa ufanisi!

source: Access denied. This dashboard is for buyers only.
sw: Hauruhusiwi. Dashibodi hii ni ya wanunuzi tu.

source: Access denied. This dashboard is for sellers only.
sw: Hauruhusiwi. Dashibodi hii ni ya wauzaji tu.

source: Access denied. This dashboard is for administrators only.
sw: Hauruhusiwi. Dashibodi hii ni ya wasimamizi tu.

source: Only sellers can accept orders.
sw: Wauzaji tu ndio wanaweza kukubali maagizo.

source: Anonymous order accepted successfully!
sw: Agizo la mtu asiyejulikana limekubaliwa kwa ufanisi!

source: Order accepted successfully!
sw: Agizo limekubaliwa kwa ufanisi!

source: Only sellers can complete orders.
sw: Wauzaji tu ndio wanaweza kukamilisha maagizo.

source: Order completed successfully!
sw: Agizo limekamilishwa kwa ufanisi!

source: Only sellers can fill daily reports.
sw: Wauzaji tu ndio wanaweza kujaza ripoti za kila siku.

source: Daily report saved successfully!
sw: Ripoti ya kila siku imehifadhiwa kwa ufanisi!

source: Access denied. Only administrators can manage users.
sw: Hauruhusiwi. Wasimamizi tu ndio wanaweza kusimamia watumiaji.

source: Username already exists.
sw: Jina la mtumiaji tayari lipo.

source: Email already exists.
sw: Barua pepe tayari ipo.

source: User created successfully!
sw: Mtumiaji ameundwa kwa ufanisi!

source: Access denied. Only administrators can view reports.
sw: Hauruhusiwi. Wasimamizi tu ndio wanaweza kuona ripoti.

source: Password Reset Code - Hazina ya Vitabu
sw: Msimbo wa Kurudisha Nenosiri - Hazina ya Vitabu

source: Your password reset code is: %(code)s This code will expire in 1 hour.
sw: Msimbo wako wa kurudisha nenosiri ni: %(code)s Msimbo huu utaisha baada ya saa 1.

source: Password reset code has been sent to your email.
sw: Msimbo wa kurudisha nenosiri umetumwa kwenye barua pepe yako.

source: No user found with this email address.
sw: Hakuna mtumiaji aliyepatikana na anuani hii ya barua pepe.

source: Invalid or expired reset code.
sw: Msimbo wa kurudisha si sahihi au umeisha muda.

source: Invalid password reset session.
sw: Kipindi cha kurudisha nenosiri si sahihi.

source: Passwords do not match.
sw: Nenosiri hazifanani.

source: Password must be at least 8 characters long.
sw: Nenosiri lazima liwe na angalau herufi 8.

source: Password has been reset successfully. You can now log in.
sw: Nenosiri limerudishwa kwa ufanisi. Sasa unaweza kuingia.

source: Invalid user.
sw: Mtumiaji si sahihi.

source: Language changed successfully!
sw: Lugha imebadilishwa kwa ufanisi!

source: Your message has been sent successfully!
sw: Ujumbe wako umetumwa kwa ufanisi!

source: There was an issue sending your message. Please try again later.
sw: Kulikuwa na tatizo la kutuma ujumbe wako. Tafadhali jaribu tena baadaye.
